index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Kevin M. Retzke</title>
<!-- 2014-01-18 Sat 21:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Kevin Retzke"/>
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Kevin M. Retzke</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Mission</h2>
<div class="outline-text-2" id="text-1">
<p>
I am a driven, creative individual seeking to apply engineering principles to solve challenging real-world problems. I enjoy obtaining new knowledge and skills to enrich myself, and am always on the lookout for ways to apply this knowledge across disciplines.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Interests</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>I enjoy programming and learning new programming languages and ways of thinking. My favorite languages are <a href="http://shop.oreilly.com/product/0636920025108.do">C</a>, <a href="http://python.org">Python</a>, <a href="http://golang.org">Go</a>, and <a href="http://clojure.org">Clojure</a>. I have experimented with many more languages, and am quick to play around with something that looks interesting (e.g. <a href="http://elm-lang.org">Elm</a>). I have a few of my tinkerings on <a href="http://github.com/retzkek">Github</a>. My favorite editor is Vim, but I have been learning Emacs, primarily for <a href="http://orgmode.org">org-mode</a>; I have also been really enjoying <a href="http://lightable.com">Light Table</a>, especially for Clojure development.
</li>
<li>I am an avid gamer, some of my favorite games recently are Borderlands 2, Mass Effect 3, Eve Online, Team Fortress 2, and Dota 2.
</li>
<li>In an effort to lose weight (so far successful, but still a ways to go) I have become an adherent to a low carb or ketogenic (keto) or paleo-ish diet. While every body is different, mine certainly performs better when carbohydrates are kept to a minimum. This, along with <a href="http://stronglifts.com">StrongLifts 5x5</a> and a <a href="http://geekdesk.com">standing desk</a> have become my recipe for a healthier me.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Education</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>BS Nuclear Engineering, Purdue University, 2004
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Experience</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Engineer, <a href="http://transware.net">TransWare Enterprises Inc</a>, January 2005 - Present</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Performed and reviewed engineering analyses in the following key areas: RPV and internals fluence evaluations, core performance and design, and dry cask storage. Applied engineering principles to develop methodologies to solve new challenges. Performed work in accordance with all applicable federal regulations, NRC and industry guidelines, and corporate and client QA programs.
</li>
<li>Experience with industry-standard software, including MCNP, Cask Loader, SIMULATE, CASMO, BWRVIA, and RAMA, as well as numerous internal tools which I was also involved in developing.
</li>
<li>Languages and technologies used for development work include Fortran, Python, C++, VTK, Qt, OpenCascade, BRL-CAD, PostgreSQL, SQLite, Objective-C, Cocoa, BASH, AWK, and Git. Environment was primarily Linux servers with variously Linux, Mac OS X, and Windows desktops.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Nuclear Engineering Co-op, Xcel Energy, August 2000 - August 2003</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Two four-month terms in the Reactor Engineering department at Prairie Island Nuclear Generating Plant. Assisted reactor engineers in daily tasks, including cooperation with various work groups including operations, maintenance, and radiation protection. Tasks included core monitoring, new fuel inspection, and startup physics testing.
</li>
<li>Three four-month terms in the Nuclear Analysis and Design group at the corporate office in Minneapolis, MN. Performed and reviewed PWR core physics calculations, including Startup and Operations Report (SOR) and Final Reload Design Review calculations using primarily CASMO/SIMULATE software packages, in addition to numerous general engineering evaluations.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kevin Retzke</p>
<p class="date">Created: 2014-01-18 Sat 21:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
